app/Controllers/BaseController.php

    protected function autoLoginFromRememberMe()
    {
        if (session()->get('id_user')) {
            return;
        }

        if (isset($_COOKIE['remember_me'])) {
            [$selector, $validator] = explode(':', $_COOKIE['remember_me']);

            $db = \Config\Database::connect();
            $token = $db->table('remember_tokens')
                        ->where('selector', $selector)
                        ->where('expires_at >=', date('Y-m-d H:i:s'))
                        ->get()
                        ->getRow();
---
SELECT *
FROM `remember_tokens`
WHERE `selector` = '5e910c7ea82b'
AND `expires_at` >= '2025-05-08 08:02:46'