app/Controllers/LoginController.php

DELETE FROM `remember_tokens`
WHERE `selector` = '5e910c7ea82b'
---
    public function logout() {

        if (isset($_COOKIE['remember_me'])) {
            [$selector] = explode(':', $_COOKIE['remember_me']);
            $db = \Config\Database::connect();
            $db->table('remember_tokens')->where('selector', $selector)->delete();