app/Models/AffiliationModel.php

    public function getAffiliationsByID($id) {
        return $this->select('affiliation.*, developers.*')
        ->join('developers', 'developers.id_developer = affiliation.id_developer')
        ->where('affiliation.id_agent', $id)
        ->findAll();
---
SELECT `affiliation`.*, `developers`.*
FROM `affiliation`
JOIN `developers` ON `developers`.`id_developer` = `affiliation`.`id_developer`
WHERE `affiliation`.`id_agent` = 'U-1'