app/Models/FavoritesModel.php

    public function getFavorites($id_user) {
        return $this->select('restate.*, favorites.*')
            ->join('restate', 'restate.id_restate = favorites.id_restate')
            ->where('favorites.id_user', $id_user)
            ->findAll();
---
SELECT `restate`.*, `favorites`.*
FROM `favorites`
JOIN `restate` ON `restate`.`id_restate` = `favorites`.`id_restate`
WHERE `favorites`.`id_user` = 'U-1'