app/Models/MessageModel.php

    public function getMessages($userID) {

        return $this->select('messages.*,
                             sender_user.firstname AS sender_firstname,
                             sender_user.lastname AS sender_lastname,
                             sender_user.role AS sender_role,
                             receiver_user.firstname AS receiver_firstname,
                             receiver_user.lastname AS receiver_lastname,
                             receiver_user.role AS receiver_role')
                    ->join('users AS sender_user', 'sender_user.id_user = messages.sender', 'left')
                    ->join('users AS receiver_user', 'receiver_user.id_user = messages.receiver', 'left')
                    ->where('messages.receiver', $userID)
                    ->orWhere('messages.sender', $userID)
                    ->orderBy('messages.created_at', 'DESC')
                    ->findAll();
---
SELECT `messages`.*, `sender_user`.`firstname` AS `sender_firstname`, `sender_user`.`lastname` AS `sender_lastname`, `sender_user`.`role` AS `sender_role`, `receiver_user`.`firstname` AS `receiver_firstname`, `receiver_user`.`lastname` AS `receiver_lastname`, `receiver_user`.`role` AS `receiver_role`
FROM `messages`
LEFT JOIN `users` AS `sender_user` ON `sender_user`.`id_user` = `messages`.`sender`
LEFT JOIN `users` AS `receiver_user` ON `receiver_user`.`id_user` = `messages`.`receiver`
WHERE `messages`.`receiver` = 'U-1'
OR `messages`.`sender` = 'U-1'
ORDER BY `messages`.`created_at` DESC