app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `username` = 'a'
 LIMIT 1
---
    public function getLogin($username, $password) {

        $user = $this->where('username', $username)->first();

SELECT *
FROM `users`
WHERE `id_user` = 'U-1'
 LIMIT 1
---
    public function getUserData($userID) {

        return $this->where('id_user', $userID)->first();

SELECT `users`.*, `affiliation`.*, `developers`.*
FROM `users`
LEFT JOIN `affiliation` ON `affiliation`.`id_agent` = `users`.`id_user`
LEFT JOIN `developers` ON `developers`.`id_developer` = `affiliation`.`id_developer`
WHERE `users`.`role` = 2
---
    public function getAgentsAndAffiliation() {
        return $this->select('users.*, affiliation.*, developers.*')
                ->join('affiliation', 'affiliation.id_agent = users.id_user', 'left')
                ->join('developers', 'developers.id_developer = affiliation.id_developer', 'left')
                ->where('users.role', 2)
                ->findAll();